In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import datetime 
import ast
import json

In [3]:
pd.set_option('display.max_colwidth', None)

In [4]:
dfgenres= pd.read_csv(r'C:\Users\flori\Desktop\DATA SCIENCE\LABS\Trabajos\Proyecto_Indiv_1_MLO_Henry\ETL\Genres.csv')
dfgenres.head()

,id,genres
0,862,"[{'id': 16, 'name': 'Animation'}, {'id': 35, 'name': 'Comedy'}, {'id': 10751, 'name': 'Family'}]"
1,15602,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, 'name': 'Comedy'}]"
2,11862,"[{'id': 35, 'name': 'Comedy'}]"
3,710,"[{'id': 12, 'name': 'Adventure'}, {'id': 28, 'name': 'Action'}, {'id': 53, 'name': 'Thriller'}]"
4,21032,"[{'id': 10751, 'name': 'Family'}, {'id': 16, 'name': 'Animation'}, {'id': 12, 'name': 'Adventure'}]"

In [49]:
dfgenres.sort_values(by='id', ascending=False)

,id,genres
1584,9992,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, 'name': 'Fantasy'}, {'id': 16, 'name': 'Animation'}, {'id': 10751, 'name': 'Family'}]"
4371,9990,"[{'id': 28, 'name': 'Action'}, {'id': 53, 'name': 'Thriller'}, {'id': 80, 'name': 'Crime'}, {'id': 18, 'name': 'Drama'}]"
3054,99861,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'name': 'Adventure'}, {'id': 878, 'name': 'Science Fiction'}]"
2362,99770,"[{'id': 10751, 'name': 'Family'}, {'id': 12, 'name': 'Adventure'}, {'id': 35, 'name': 'Comedy'}]"
3640,99760,"[{'id': 18, 'name': 'Drama'}]"
...,...,...
1039,10009,"[{'id': 12, 'name': 'Adventure'}, {'id': 16, 'name': 'Animation'}, {'id': 10751, 'name': 'Family'}]"
1536,10007,"[{'id': 27, 'name': 'Horror'}, {'id': 53, 'name': 'Thriller'}]"
2203,10005,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'name': 'Adventure'}, {'id': 53, 'name': 'Thriller'}]"
2867,100042,"[{'id': 35, 'name': 'Comedy'}]"
207,10003,"[{'id': 53, 'name': 'Thriller'}, {'id': 28, 'name': 'Action'}, {'id': 10749, 'name': 'Romance'}, {'id': 878, 'name': 'Science Fiction'}, {'id': 12, 'name': 'Adventure'}]"

In [20]:
dfgenres['genres'] = dfgenres['genres'].apply(ast.literal_eval)

In [24]:
df_exploded = dfgenres.explode('genres', ignore_index=True) 
df_exploded.head()

      id                            genres
0    862   {'id': 16, 'name': 'Animation'}
1    862      {'id': 35, 'name': 'Comedy'}
2    862   {'id': 10751, 'name': 'Family'}
3  15602  {'id': 10749, 'name': 'Romance'}
4  15602      {'id': 35, 'name': 'Comedy'}

In [25]:
df_exploded['name_genres'] = df_exploded['genres'].apply(lambda x: x.get('name', '') if isinstance(x, dict) else '')
df_exploded['id_genres'] = df_exploded['genres'].apply(lambda x: x.get('id', '') if isinstance(x, dict) else '')

In [26]:
df_exploded.head()

      id                            genres name_genres id_genres
0    862   {'id': 16, 'name': 'Animation'}   Animation        16
1    862      {'id': 35, 'name': 'Comedy'}      Comedy        35
2    862   {'id': 10751, 'name': 'Family'}      Family     10751
3  15602  {'id': 10749, 'name': 'Romance'}     Romance     10749
4  15602      {'id': 35, 'name': 'Comedy'}      Comedy        35

In [27]:
df_exploded.drop(columns='genres')

           id name_genres id_genres
0         862   Animation        16
1         862      Comedy        35
2         862      Family     10751
3       15602     Romance     10749
4       15602      Comedy        35
...       ...         ...       ...
11151   19307      Comedy        35
11152   21251      Comedy        35
11153  460135   Animation        16
11154  182030      Action        28
11155  182030     Foreign     10769

[11156 rows x 3 columns]

In [29]:
grouped_df = df_exploded.groupby('id').agg({'name_genres': lambda x: "'" + "' '".join(x) + "'",
                                           'id_genres': lambda x: "'" + ','.join(map(str, x)) + "'"}).reset_index()

grouped_df

,id,name_genres,id_genres
0,10003,'Thriller' 'Action' 'Romance' 'Science Fiction' 'Adventure',"'53,28,10749,878,12'"
1,100042,'Comedy','35'
2,10005,'Action' 'Adventure' 'Thriller',"'28,12,53'"
3,10007,'Horror' 'Thriller',"'27,53'"
4,10009,'Adventure' 'Animation' 'Family',"'12,16,10751'"
...,...,...,...
4483,99760,'Drama','18'
4484,99770,'Family' 'Adventure' 'Comedy',"'10751,12,35'"
4485,99861,'Action' 'Adventure' 'Science Fiction',"'28,12,878'"
4486,9990,'Action' 'Thriller' 'Crime' 'Drama',"'28,53,80,18'"
4487,9992,'Adventure' 'Fantasy' 'Animation' 'Family',"'12,14,16,10751'"

In [48]:
grouped_df.sort_values(by='id', ascending=False)

,id,name_genres,id_genres
4487,9992,'Adventure' 'Fantasy' 'Animation' 'Family',"'12,14,16,10751'"
4486,9990,'Action' 'Thriller' 'Crime' 'Drama',"'28,53,80,18'"
4485,99861,'Action' 'Adventure' 'Science Fiction',"'28,12,878'"
4484,99770,'Family' 'Adventure' 'Comedy',"'10751,12,35'"
4483,99760,'Drama','18'
...,...,...,...
4,10009,'Adventure' 'Animation' 'Family',"'12,16,10751'"
3,10007,'Horror' 'Thriller',"'27,53'"
2,10005,'Action' 'Adventure' 'Thriller',"'28,12,53'"
1,100042,'Comedy','35'
0,10003,'Thriller' 'Action' 'Romance' 'Science Fiction' 'Adventure',"'53,28,10749,878,12'"

In [34]:
grouped_df['id'].unique()

array(['10003', '100042', '10005', ..., '99861', '9990', '9992'],
      dtype=object)

In [35]:
df_exploded['id'].unique()

array(['862', '15602', '11862', ..., '21251', '460135', '182030'],
      dtype=object)

In [21]:
def desanidar_generos(genres):
    """
    Desanida los gÃ©neros contenidos en una lista de diccionarios.

    Args:
        genres (list): Lista de diccionarios que representan los gÃ©neros.

    Returns:
        tuple: Una tupla que contiene dos listas: genero_id y genero_nombre.

    """
    genero_id = []
    genero_nombre = []
    for genero in genres:
        genero_id.append(genero['id'])
        genero_nombre.append(genero['name'])
    return genero_id, genero_nombre

# Aplicar la funciÃ³n desanidar_generos a la columna 'genres'
generos_desanidados = dfgenres['genres'].apply(lambda x: desanidar_generos(eval(x)))

# Crear un nuevo DataFrame a partir de los gÃ©neros desanidados
dfgeneros = pd.DataFrame(generos_desanidados.tolist(), columns=['ID_Genero', 'Genero'])

# Explotar las columnas para que cada fila tenga un solo gÃ©nero
dfgeneros = dfgeneros.apply(pd.Series.explode)

# Reiniciar el Ã­ndice del DataFrame
dfgeneros = dfgeneros.reset_index(drop=True)

# Mostrar las primeras filas del nuevo DataFrame
dfgeneros.head()

TypeError: eval() arg 1 must be a string, bytes or code object

In [ ]:
dfgeneros.head()

In [9]:
genera_Data = pd.concat([dfgenres, dfgeneros[['ID_Genero', 'Genero']]], axis=1) 
genera_Data.head()

,id,genres,ID_Genero,Genero
0,862,"[{'id': 16, 'name': 'Animation'}, {'id': 35, 'name': 'Comedy'}, {'id': 10751, 'name': 'Family'}]",16,Animation
1,15602,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, 'name': 'Comedy'}]",35,Comedy
2,11862,"[{'id': 35, 'name': 'Comedy'}]",10751,Family
3,710,"[{'id': 12, 'name': 'Adventure'}, {'id': 28, 'name': 'Action'}, {'id': 53, 'name': 'Thriller'}]",10749,Romance
4,21032,"[{'id': 10751, 'name': 'Family'}, {'id': 16, 'name': 'Animation'}, {'id': 12, 'name': 'Adventure'}]",35,Comedy

In [10]:
genera_Data.drop(columns='genres')

          id ID_Genero     Genero
0        862        16  Animation
1      15602        35     Comedy
2      11862     10751     Family
3        710     10749    Romance
4      21032        35     Comedy
...      ...       ...        ...
11151    NaN        35     Comedy
11152    NaN        35     Comedy
11153    NaN        16  Animation
11154    NaN        28     Action
11155    NaN     10769    Foreign

[11156 rows x 3 columns]

In [14]:
len(genera_Data['Genero'].unique())

33

In [19]:
genera_Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11156 entries, 0 to 11155
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         4491 non-null   object
 1   genres     4491 non-null   object
 2   ID_Genero  11089 non-null  object
 3   Genero     11089 non-null  object
dtypes: object(4)
memory usage: 348.8+ KB

In [7]:
dfgeneros.shape

(11156, 2)

In [8]:
dfgeneros.to_csv('GenerosFinal.csv', index=False)

In [38]:
dfgenres2= pd.read_csv(r'C:\Users\flori\Desktop\DATA SCIENCE\LABS\Trabajos\Proyecto_Indiv_1_MLO_Henry\DATASETS\movies_test.csv')

In [39]:
dfgenres2['genres'] = dfgenres2['genres'].apply(ast.literal_eval)

In [41]:
df_exploded2 = dfgenres2.explode('genres', ignore_index=True)

In [42]:
df_exploded2['name_genres'] = df_exploded2['genres'].apply(lambda x: x.get('name', '') if isinstance(x, dict) else '')
df_exploded2['id_genres'] = df_exploded2['genres'].apply(lambda x: x.get('id', '') if isinstance(x, dict) else '')

In [43]:
df_exploded2.head(1)

,adult,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,overview,...,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,name_genres,id_genres
0,False,"{'id': 10194, 'name': 'Toy Story Collection', 'poster_path': '/7G9915LfUQ2lVfwMEEhDsn3kT4B.jpg', 'backdrop_path': '/9FBwqcd9IRruEDUrTdcaafOMKUq.jpg'}",30000000,"{'id': 16, 'name': 'Animation'}",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his room until Andy's birthday brings Buzz Lightyear onto the scene. Afraid of losing his place in Andy's heart, Woody plots against Buzz. But when circumstances separate Buzz and Woody from their owner, the duo eventually learns to put aside their differences.",...,81.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,NaN,Toy Story,False,7.7,5415,Animation,16

In [45]:
dfprueba = df_exploded2[['id','id_genres','name_genres']]
dfprueba

       id  id_genres name_genres
0     862         16   Animation
1     862         35      Comedy
2     862      10751      Family
3    8844         12   Adventure
4    8844         14     Fantasy
5    8844      10751      Family
6   15602      10749     Romance
7   15602         35      Comedy
8   31357         35      Comedy
9   31357         18       Drama
10  31357      10749     Romance
11  11862         35      Comedy

In [46]:
grouped_df2 = df_exploded2.groupby('id').agg({'name_genres': lambda x: "'" + "' '".join(x) + "'",
                                           'id_genres': lambda x: "'" + ','.join(map(str, x)) + "'"}).reset_index()

grouped_df2

      id                     name_genres      id_genres
0    862   'Animation' 'Comedy' 'Family'  '16,35,10751'
1   8844  'Adventure' 'Fantasy' 'Family'  '12,14,10751'
2  11862                        'Comedy'           '35'
3  15602              'Romance' 'Comedy'     '10749,35'
4  31357      'Comedy' 'Drama' 'Romance'  '35,18,10749'

In [50]:
grouped_df2.sort_values(by='id', ascending=False)

      id                     name_genres      id_genres
4  31357      'Comedy' 'Drama' 'Romance'  '35,18,10749'
3  15602              'Romance' 'Comedy'     '10749,35'
2  11862                        'Comedy'           '35'
1   8844  'Adventure' 'Fantasy' 'Family'  '12,14,10751'
0    862   'Animation' 'Comedy' 'Family'  '16,35,10751'